xml.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v19="http://fedex.com/ws/track/v19">
    <soapenv:Header/>
    <soapenv:Body>
        <v19:TrackRequest>
            <v19:WebAuthenticationDetail>
                <v19:ParentCredential>
                    <v19:Key>GcICmLx118dWJ7pw</v19:Key>
                    <v19:Password>Az4BZtlKJHVG4DHxECiM3shkX</v19:Password>
                </v19:ParentCredential>
                <v19:UserCredential>
                    <v19:Key>GcICmLx118dWJ7pw</v19:Key>
                    <v19:Password>Az4BZtlKJHVG4DHxECiM3shkX</v19:Password>
                </v19:UserCredential>
            </v19:WebAuthenticationDetail>
            <v19:ClientDetail>
                <v19:AccountNumber>510087380</v19:AccountNumber>
                <v19:MeterNumber>100548551</v19:MeterNumber>
            </v19:ClientDetail>
            <v19:TransactionDetail>
                <v19:CustomerTransactionId>Track By Number_v19</v19:CustomerTransactionId>
                <v19:Localization>
                    <v19:LanguageCode>EN</v19:LanguageCode>
                    <v19:LocaleCode>US</v19:LocaleCode>
                </v19:Localization>
            </v19:TransactionDetail>
            <v19:Version>
                <v19:ServiceId>trck</v19:ServiceId>
                <v19:Major>19</v19:Major>
                <v19:Intermediate>0</v19:Intermediate>
                <v19:Minor>0</v19:Minor>
            </v19:Version>
            <v19:SelectionDetails>
                <v19:CarrierCode>FDXE</v19:CarrierCode>
                <v19:PackageIdentifier>
                    <v19:Type>TRACKING_NUMBER_OR_DOORTAG</v19:Type>
                    <v19:Value>280795728530</v19:Value>
                </v19:PackageIdentifier>
                <v19:ShipmentAccountNumber/>
                <v19:SecureSpodAccount/>
                <v19:Destination>
                    <v19:GeographicCoordinates>rates evertitque aequora</v19:GeographicCoordinates>
                </v19:Destination>
            </v19:SelectionDetails>
        </v19:TrackRequest>
    </soapenv:Body>
</soapenv:Envelope>
